fustyles/Arduino/ESP32-CAM_Car/ESP32-CAM_CAR_2pwm_knn-classifier/app_httpd.cpp
        <script>
          var canvas = document.getElementById('canvas');
          var context = canvas.getContext("2d"); 
          var clearAllClasses = document.getElementById('clearAllClasses');
          var addExample = document.getElementById('addExample');
          var stream = document.getElementById('stream');
          var example = document.getElementById('example');
          var Class = document.getElementById('Class');
          var result = document.getElementById('result');
          var count = document.getElementById('count');
          var getStill = document.getElementById('get-still');
          var getModel = document.getElementById('getModel');
          var nostop = document.getElementById('nostop');
          
          function predictClass_onclick (event) {
            example.onload = function () {
              predictClass(example);
            }
            context.drawImage(stream, 0, 0, stream.width, stream.height ,0 ,0 ,canvas.width, canvas.height);
            example.src = canvas.toDataURL('image/jpeg');
          };    
          
          function clearAllClasses_onclick (event) {
            result.innerHTML = '';
            count.innerHTML = "0";
            classifier.clearAllClasses();
          };
          clearAllClasses.addEventListener("click", clearAllClasses_onclick, true);           
          
          function addExample_onclick (event) {
            context.drawImage(stream, 0, 0, stream.width, stream.height ,0 ,0 ,canvas.width, canvas.height);
            example.src = canvas.toDataURL('image/jpeg');
            addExampleImage(example, Class.value);
            count.innerHTML = Number(count.innerHTML)+1;
          };
          addExample.addEventListener("click", addExample_onclick, true);
          
        </script>
        
        <!-- Place your code in the script tag below. You can also use an external .js file -->
        <script>
          var classifier;
          var mobilenetModule;
          
          // Create the classifier.
          classifier = knnClassifier.create();
          
          // Load mobilenet.
          mobilenet.load().then(Module => {
            mobilenetModule = Module;
            result.innerHTML = '';
            getStill.click();
          }); 
          
          function addExampleImage(img,index) {
            // Add MobileNet activations to the model repeatedly for all classes.
            var Image = tf.browser.fromPixels(img);
            var logits = mobilenetModule.infer(Image, 'conv_preds');
            classifier.addExample(logits, index);
          }
          
          async function predictClass(img) {
            try {
              // Make a prediction.
              const Image = tf.browser.fromPixels(img);
              const xlogits = mobilenetModule.infer(Image, 'conv_preds');
              const predict = await classifier.predictClass(xlogits);
              //console.log(predict);

              if (predict.label) {     // predict.label -> 0 to 9
                var msg = "<font color='red'>Result : class " + predict.label + "</font><br><br>";
                for (i=0;i<Class.length;i++) {
                  if (predict.confidences[i.toString()]>=0) msg += "[train "+i+"] " + predict.confidences[i.toString()] + "<br>";
                }
                result.innerHTML = msg; 
                                
                if (document.getElementById('message').innerHTML==predict.label) return;
                document.getElementById('message').innerHTML= predict.label;
                if (predict.label=="1") {
                  try {
                    ifr.src = document.location.origin+'/control?var=car&val=1';
                  }
                  catch(e){}
                }
                else if (predict.label=="2") {
                  try {
                    ifr.src = document.location.origin+'/control?var=car&val=2';
                  }
                  catch(e){}
                }
                else if (predict.label=="3") {
                  try {
                    ifr.src = document.location.origin+'/control?var=car&val=3';
                  }
                  catch(e){}
                }
                else if (predict.label=="4") {
                  try {
                    ifr.src = document.location.origin+'/control?var=car&val=4';
                  }
                  catch(e){}
                }    
                else if (predict.label=="5") {
                  try {
                    ifr.src = document.location.origin+'/control?var=car&val=5';
                  }
                  catch(e){}
                }  
              }
            }
            catch (e) {
            }
          }
          
          function saveModel() {
            let dataset = classifier.getClassifierDataset();
            let myDataset = {}
            Object.keys(dataset).forEach((key) => {
              let data = dataset[key].dataSync();
              myDataset[key] = Array.from(data);
            });
            let json = JSON.stringify(myDataset)
            
            var link = document.createElement('a');
            link.download="model.json";
            link.href='data:text/text;charset=utf-8,' + encodeURIComponent(json);
            document.body.appendChild(link);
            link.click();
            link.remove();
          }
          
          getModel.onchange = function (event) {
            var target = event.target || window.event.srcElement;
            var files = target.files;
            var fr = new FileReader();
            if (files.length>0) {
                fr.onload = function () {     
                  var dataset = fr.result;
                  var myDataset = JSON.parse(dataset)
                  Object.keys(myDataset).forEach((key) => {
                    myDataset[key] = tf.tensor(myDataset[key], [myDataset[key].length / 1024, 1024]);
                  })
                  classifier.setClassifierDataset(myDataset);
                }
                fr.readAsText(files[0]);
              }
            }
      
            stream.onload = function (event) {
              if (document.getElementById('startdetection').checked) {
                console.log("detection");
                predictClass_onclick();
              }
              if (mobilenetModule) {
                try { 
                  document.createEvent("TouchEvent");
                  setTimeout(function(){getStill.click();},250);
                }
                catch(e) { 
                  setTimeout(function(){getStill.click();},150);
                } 
              }
            }
        </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    //httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    //return httpd_resp_send(req, (const char *)index_html_gz, index_html_gz_len);
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };


    ra_filter_init(&ra_filter, 20);
    
    mtmn_config.min_face = 80;
    mtmn_config.pyramid = 0.7;
    mtmn_config.p_threshold.score = 0.6;
    mtmn_config.p_threshold.nms = 0.7;
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 4;
    mtmn_config.o_threshold.score = 0.7;
    mtmn_config.o_threshold.nms = 0.4;
    mtmn_config.o_threshold.candidate_number = 1;
    
    face_id_init(&id_list, FACE_ID_SAVE_NUMBER, ENROLL_CONFIRM_TIMES);
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
